app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "release_date", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def add_tmdb
    add = params[:tmdb_movies]

    if add.nil?
      flash[:notice] = 'No movies are selected.'
      redirect_to movies_path
    elsif add.length == 0
      flash[:notice] = 'No movies are selected.'
      redirect_to movies_path
    else
      add.keys.each do |id|
        Movie.create_from_tmdb(id)